scc2425-tukano/artillery-scripts/test-create-users.yaml
config:
  target: "http://localhost:8080/tukano-1/rest"
  phases:
    - duration: 10
      arrivalRate: 1

scenarios:
  - flow:
      - post:
          url: "/users"
          json:
            username: "user_{{ $randomString }}"
            password: "{{ $randomString }}"
            email: "user{{ $randomInt }}@example.com"
            name: "User {{ $randomInt }}"