scc2425-tukano/artillery-scripts/test-create-users.yaml
config:
  target: "http://localhost:8080/rest"
  phases:
    - duration: 200
      arrivalRate: 1

scenarios:
  - flow:
      - post:
          url: "/users"
          json:
            userId: "user_{{ $uuid }}"  # Use uuid to ensure unique userId
            pwd: "{{ $uuid }}"       # Use the random integer defined in `variables`
            email: "user{{ $uuid }}@example.com"  # Generate unique email
            displayName: "User {{ $uuid }}"  # Generate unique display name