scc2425-tukano/artillery-scripts/test-upload-blobs.yaml
config:
  target: "http://localhost:8080/rest"
  phases:
    - duration: 1
      arrivalRate: 1

scenarios:
  - flow:
      - post:
          url: "/blobs/http://pcpedro:8080/rest/blobs/user_e51c7e86-aec1-43c4-a0c6-b759664aaded+65b485b1-bcb4-42bd-81c8-7305e746cd0e?token=example_token"
          headers:
            Content-Type: "application/octet-stream"
          qs:
            token: "example_token"
          body: !!binary |
            AAECAwQFBgcICQoLDA0ODw==